# Data Exploration on Multiple Tables Using SQL Queries (PostgreSQL)

## By Dovic Bravo

### Table of Contents

* [Goals](#goals)
* [Importing Libraries](#importinglibraries)
    * [Data Set](#section1_1)
* [SQL Queries and Exploration](#sqlqueriesandexploration)
* [Conclusion](#conclusion)
    * [Next Step](#section2_1)

#### Goals

In this project, we will work with multiple tables using SQL in Jupyter Notebook to explore and analyze from this database.

#### Importing Libraries

Importing necessary libraries in order to use and be able to import from the databse PostgreSQL.

In [1]:
import psycopg2 as ps
import configparser
import pandas as pd
#magic function that will allow us to connect the postgresql database
%load_ext sql

##### Data Set:

The database file is called `greencyles` which contains the tables of the following: 

* `actor`
* `address`
* `category`
* `city`
* `country`
* `customer`
* `film`
* `film_actor`
* `film_category`
* `inventory`
* `language`
* `payment`
* `rental`
* `staff`
* `store`

#### SQL Queries and Exploration

Creating a list of all the different `(DISTINCT)` replacement costs of the films and
finding out the `lowest replacement cost`.

In [22]:
%%sql
    SELECT DISTINCT replacement_cost
    FROM film
    ORDER BY 1 
    LIMIT 5

 * postgresql://postgres:***@localhost/greencycles
5 rows affected.

[(Decimal('9.99'),),
 (Decimal('10.99'),),
 (Decimal('11.99'),),
 (Decimal('12.99'),),
 (Decimal('13.99'),)]

Writing a query that gives an overview of `how many films have replacement costs in the following cost ranges` and
finding out `how many films have a replacement cost in each cost ranges`.

In [8]:
%%sql
    SELECT 
        CASE 
            WHEN replacement_cost BETWEEN 9.99 AND 19.99
            THEN 'low'
            WHEN replacement_cost BETWEEN 20 AND 24.99
            THEN 'medium'
            ELSE 'high'
        END as cost_range,
    COUNT(*)
    FROM film
    GROUP BY cost_range

 * postgresql://postgres:***@localhost/greencycles
3 rows affected.

[('medium', 250), ('high', 236), ('low', 514)]

Creating a list of the film titles including their title, length, and category name ordered descendingly by length,
filtered to the movie category only to `Drama` and `Sports`.
Finding out `which category is the longest film and how long it is`.

In [14]:
%%sql
    SELECT 
        title,
        name,
        length
    FROM film f
    LEFT JOIN film_category fc
    ON f.film_id=fc.film_id
    LEFT JOIN category c
    ON c.category_id=fc.category_id
    WHERE name = 'Sports' OR name = 'Drama'
    ORDER BY length DESC
    LIMIT 10

 * postgresql://postgres:***@localhost/greencycles
10 rows affected.

[('SMOOCHY CONTROL', 'Sports', 184),
 ('RECORDS ZORRO', 'Sports', 182),
 ('STAR OPERATION', 'Sports', 181),
 ('JACKET FRISCO', 'Drama', 181),
 ('SOMETHING DUCK', 'Drama', 180),
 ('MUSSOLINI SPOILERS', 'Sports', 180),
 ('SLACKER LIAISONS', 'Drama', 179),
 ('FLIGHT LIES', 'Sports', 179),
 ('ANONYMOUS HUMAN', 'Sports', 179),
 ('TORQUE BOUND', 'Drama', 179)]

Creating an overview of how many movies `(titles)` there are in each category `(name)`.
Finding out the `most common among the films`.

In [15]:
%%sql
    SELECT
        name,
        COUNT(title)
        FROM film f
    INNER JOIN film_category fc
    ON f.film_id=fc.film_id
    INNER JOIN category c
    ON c.category_id=fc.category_id
    GROUP BY name
    ORDER BY 2 DESC

 * postgresql://postgres:***@localhost/greencycles
16 rows affected.

[('Sports', 74),
 ('Foreign', 73),
 ('Family', 69),
 ('Documentary', 68),
 ('Animation', 66),
 ('Action', 64),
 ('New', 63),
 ('Drama', 62),
 ('Sci-Fi', 61),
 ('Games', 61),
 ('Children', 60),
 ('Comedy', 58),
 ('Travel', 57),
 ('Classics', 57),
 ('Horror', 56),
 ('Music', 51)]

Creating an overview of the revenue `(sum of amount)` grouped by a column in the format `"country"` and `"city"`.
Finding out `the country who has the least amount of sales`.

In [27]:
%%sql
    SELECT 
        country ||', ' ||city AS country_and_city,
        SUM(amount)
    FROM payment p
    LEFT JOIN customer c
    ON p.customer_id=c.customer_id
    LEFT JOIN address a
    ON a.address_id=c.address_id
    LEFT JOIN city ci
    ON ci.city_id=a.city_id
    LEFT JOIN country co
    ON co.country_id=ci.country_id
    GROUP BY country ||', ' ||city
    ORDER BY 2 ASC
    LIMIT 10

 * postgresql://postgres:***@localhost/greencycles
10 rows affected.

[('United States, Tallahassee', Decimal('50.85')),
 ('China, Fuzhou', Decimal('50.86')),
 ('Poland, Bydgoszcz', Decimal('52.88')),
 ('Sudan, al-Qadarif', Decimal('57.81')),
 ('Mozambique, Tete', Decimal('58.82')),
 ('Switzerland, Basel', Decimal('58.86')),
 ('China, Enshi', Decimal('59.86')),
 ('India, Hubli-Dharwad', Decimal('62.85')),
 ('Taiwan, Tsaotun', Decimal('64.81')),
 ('India, Kanchrapara', Decimal('65.84'))]

Creating a list with `the average of the sales amount each staff_id has per customer`. Finding out `the staff_id who has the highest revenue per customer`.

In [34]:
%%sql
    SELECT 
        staff_id,
        ROUND(AVG(total),2) as avg_amount 
    FROM (SELECT
        staff_id,
        customer_id,
        SUM(amount) as total
        FROM payment
        GROUP BY customer_id, staff_id) sub
    GROUP BY staff_id

 * postgresql://postgres:***@localhost/greencycles
2 rows affected.

[(2, Decimal('56.64')), (1, Decimal('55.91'))]

Creating a query that `shows average daily renenue of all Sundays`. Finding out `the daily average revenue of all Sundays`.

In [38]:
%%sql
    SELECT 
        ROUND(AVG(total),2)
        FROM 
            (SELECT
                 SUM(amount) as total,
                 DATE(payment_date),
                 EXTRACT(dow from payment_date) as weekday
             FROM payment
             WHERE EXTRACT(dow from payment_date)=0
             GROUP BY DATE(payment_date),weekday) daily

 * postgresql://postgres:***@localhost/greencycles
1 rows affected.

[(Decimal('1763.59'),)]

#### Conclusion

By administering the queries, we pulled out several information from different tables such as:
* `The lowest replacement cost`.
* `The replacement cost in each ranges`.
* `The longest film length is in Sport Category`.
* `Sport category is the most common among the film categories`.
* `Tallhassee City in United States has the least amount of sales`.
* `Staff_id 2 has the highest revenue per customer`.
* `The daily average revenue of all Sundays`.

##### Next Step

There are still tables in the dataset that are not explored that can provide further information.